-- --------------------------------------------------------
-- Host:                         127.0.0.1
-- Server version:               8.0.30 - MySQL Community Server - GPL
-- Server OS:                    Win64
-- HeidiSQL Version:             12.1.0.6537
-- --------------------------------------------------------

/*!40101 SET @OLD_CHARACTER_SET_CLIENT=@@CHARACTER_SET_CLIENT */;
/*!40101 SET NAMES utf8 */;
/*!50503 SET NAMES utf8mb4 */;
/*!40103 SET @OLD_TIME_ZONE=@@TIME_ZONE */;
/*!40103 SET TIME_ZONE='+00:00' */;
/*!40014 SET @OLD_FOREIGN_KEY_CHECKS=@@FOREIGN_KEY_CHECKS, FOREIGN_KEY_CHECKS=0 */;
/*!40101 SET @OLD_SQL_MODE=@@SQL_MODE, SQL_MODE='NO_AUTO_VALUE_ON_ZERO' */;
/*!40111 SET @OLD_SQL_NOTES=@@SQL_NOTES, SQL_NOTES=0 */;

-- Dumping structure for table app_register.app_config
CREATE TABLE IF NOT EXISTS `app_config` (
  `configid` int unsigned NOT NULL,
  `configname` varchar(50) COLLATE utf8mb4_bin DEFAULT NULL,
  `configvalue` varchar(50) COLLATE utf8mb4_bin DEFAULT NULL,
  PRIMARY KEY (`configid`)
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_bin;

-- Dumping data for table app_register.app_config: ~1 rows (approximately)
INSERT INTO `app_config` (`configid`, `configname`, `configvalue`) VALUES
	(1, 'onoff', 'on');

-- Dumping structure for table app_register.members
CREATE TABLE IF NOT EXISTS `members` (
  `id` int NOT NULL AUTO_INCREMENT,
  `username` varchar(65) NOT NULL DEFAULT '',
  `password` varchar(150) NOT NULL DEFAULT '',
  `teacher_id` varchar(15) DEFAULT NULL,
  `per_type` enum('admin','teacher') DEFAULT NULL,
  `fname` varchar(50) DEFAULT NULL,
  `lname` varchar(50) DEFAULT NULL,
  `address` varchar(255) DEFAULT NULL,
  `email` varchar(65) DEFAULT NULL,
  `verified` tinyint(1) NOT NULL DEFAULT '1',
  `mod_timestamp` timestamp NOT NULL DEFAULT CURRENT_TIMESTAMP ON UPDATE CURRENT_TIMESTAMP,
  `picture_profile` varchar(255) DEFAULT NULL,
  `sex` enum('male','female') DEFAULT NULL,
  `phone` varchar(15) DEFAULT NULL,
  `status_user` tinyint(1) NOT NULL DEFAULT '1' COMMENT 'สถานะของ user',
  PRIMARY KEY (`id`),
  UNIQUE KEY `username_UNIQUE` (`username`),
  UNIQUE KEY `id_UNIQUE` (`id`),
  UNIQUE KEY `email_UNIQUE` (`email`)
) ENGINE=InnoDB AUTO_INCREMENT=2 DEFAULT CHARSET=utf8mb3 ROW_FORMAT=COMPACT;

-- Dumping data for table app_register.members: ~1 rows (approximately)
INSERT INTO `members` (`id`, `username`, `password`, `teacher_id`, `per_type`, `fname`, `lname`, `address`, `email`, `verified`, `mod_timestamp`, `picture_profile`, `sex`, `phone`, `status_user`) VALUES
	(1, 'admin', '$2y$10$DKlVrTfJCO6QamlFPBVWvOcdwtf0jwibKB.R0Img6Dwq4eWdYwc2K', NULL, 'admin', 'admin', 'admin', NULL, NULL, 1, '2021-12-08 04:01:08', NULL, NULL, NULL, 1);

-- Dumping structure for table app_register.org
CREATE TABLE IF NOT EXISTS `org` (
  `org_id` int NOT NULL COMMENT 'ไอดีกระทรวง กรม',
  `org_name` varchar(255) DEFAULT NULL COMMENT 'ชื่อกระทรวง',
  `quota` int NOT NULL,
  PRIMARY KEY (`org_id`)
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb3;

-- Dumping data for table app_register.org: ~249 rows (approximately)
INSERT INTO `org` (`org_id`, `org_name`, `quota`) VALUES
	(1, 'สำนักงานปลัดสำนักนายกรัฐมนตรี', 2),
	(2, 'กรมประชาสัมพันธ์', 2),
	(3, 'สำนักข่าวกรองแห่งชาติ', 2),
	(4, 'สำนักงบประมาณ', 2),
	(5, 'สำนักงานขับเคลื่อนการปฏิรูปประเทศ ยุทธศาสตร์ชาติ และการสร้างความสามัคคีปรองดอง', 2),
	(6, 'สำนักงานคณะกรรมการกฤษฎีกา', 2),
	(7, 'สำนักงานคณะกรรมการข้าราชการพลเรือน', 2),
	(8, 'สำนักงานคณะกรรมการคุ้มครองผู้บริโภค', 2),
	(9, 'สำนักงานคณะกรรมการนโยบายที่ดินแห่งชาติ', 2),
	(10, 'สำนักงานคณะกรรมการพัฒนาระบบราชการ', 2),
	(11, 'สำนักงานคณะกรรมการส่งเสริมการลงทุน', 2),
	(12, 'สำนักงานทรัพยากรน้ำแห่งชาติ', 2),
	(13, 'สำนักงานสภาความมั่นคงแห่งชาติ', 2),
	(14, 'สำนักงานสภาพัฒนาการเศรษฐกิจและสังคมแห่งชาติ', 2),
	(15, 'สำนักเลขาธิการคณะรัฐมนตรี', 2),
	(16, 'สำนักเลขาธิการนายกรัฐมนตรี', 2),
	(17, 'กองอำนวยการรักษาความมั่นคงภายในราชอาณาจักร (กอ.รมน.)', 2),
	(18, 'ศูนย์อำนวยการรักษาผลประโยชน์ของชาติทางทะเล', 2),
	(19, 'ราชวิทยาลัยจุฬาภรณ์', 2),
	(20, 'สำนักงานปลัดกระทรวงกลาโหม', 2),
	(21, 'กองทัพบก', 2),
	(22, 'กองทัพเรือ', 2),
	(23, 'กองทัพอากาศ', 2),
	(24, 'กองบัญชาการกองทัพไทย', 2),
	(25, 'สำนักงานปลัดกระทรวงการคลัง', 2),
	(26, 'กรมธนารักษ์', 2),
	(27, 'กรมบัญชีกลาง ', 2),
	(28, 'กรมศุลกากร', 2),
	(29, 'กรมสรรพสามิต', 2),
	(30, 'กรมสรรพากร', 2),
	(31, 'สำนักงานคณะกรรมการนโยบายรัฐวิสาหกิจ', 2),
	(32, 'สำนักงานบริหารหนี้สาธารณะ', 2),
	(33, 'สำนักงานเศรษฐกิจการคลัง', 2),
	(34, 'สำนักงานปลัดกระทรวงการต่างประเทศ', 2),
	(35, 'สำนักงานปลัดกระทรวงการท่องเที่ยวและกีฬา', 2),
	(36, 'กรมการท่องเที่ยว', 2),
	(37, 'กรมพลศึกษา', 2),
	(38, 'มหาวิทยาลัยการกีฬาแห่งชาติ', 2),
	(39, 'สำนักงานปลัดกระทรวงการพัฒนาสังคมและความมั่นคงของมนุษย์', 2),
	(40, 'กรมกิจการเด็กและเยาวชน', 2),
	(41, 'กรมกิจการผู้สูงอายุ', 2),
	(42, 'กรมกิจการสตรีและสถาบันครอบครัว', 2),
	(43, 'กรมพัฒนาสังคมและสวัสดิการ', 2),
	(44, 'สำนักงานส่งเสริมและพัฒนาคุณภาพชีวิตคนพิการ', 2),
	(45, 'สำนักงานปลัดกระทรวงการอุดมศึกษา วิทยาศาสตร์ วิจัยและนวัตกรรม', 2),
	(46, 'กรมวิทยาศาสตร์บริการ', 2),
	(47, 'สำนักงานการวิจัยแห่งชาติ', 2),
	(48, 'สำนักงานปรมาณูเพื่อสันติ', 2),
	(49, 'สำนักงานปลัดกระทรวงเกษตรและสหกรณ์', 2),
	(50, 'กรมการข้าว ', 2),
	(51, 'กรมชลประทาน', 2),
	(52, 'กรมตรวจบัญชีสหกรณ์', 2),
	(53, 'กรมประมง', 2),
	(54, 'กรมปศุสัตว์', 2),
	(55, 'กรมฝนหลวงและการบินเกษตร', 2),
	(56, 'กรมพัฒนาที่ดิน', 2),
	(57, 'กรมวิชาการเกษตร', 2),
	(58, 'กรมส่งเสริมการเกษตร', 2),
	(59, 'กรมส่งเสริมสหกรณ์', 2),
	(60, 'กรมหม่อนไหม', 2),
	(61, 'สำนักงานการปฏิรูปที่ดินเพื่อเกษตรกรรม ', 2),
	(62, 'สำนักงานมาตรฐานสินค้าเกษตรและอาหารแห่งชาติ', 2),
	(63, 'สำนักงานเศรษฐกิจการเกษตร', 2),
	(64, 'สำนักงานปลัดกระทรวงคมนาคม', 2),
	(65, 'กรมการขนส่งทางบก', 2),
	(66, 'กรมการขนส่งทางราง', 2),
	(67, 'กรมเจ้าท่า', 2),
	(68, 'กรมทางหลวง', 2),
	(69, 'กรมทางหลวงชนบท', 2),
	(70, 'กรมท่าอากาศยาน', 2),
	(71, 'สำนักงานนโยบายและแผนการขนส่งและจราจร', 2),
	(72, 'สำนักงานปลัดกระทรวงดิจิทัลเพื่อเศรษฐกิจและสังคม', 2),
	(73, 'กรมอุตุนิยมวิทยา', 2),
	(74, 'สำนักงานคณะกรรมการดิจิทัลเพื่อเศรษฐกิจและสังคมแห่งชาติ', 2),
	(75, 'สำนักงานสถิติแห่งชาติ', 2),
	(76, 'สำนักงานปลัดกระทรวงทรัพยากรธรรมชาติและสิ่งแวดล้อม', 2),
	(77, 'กรมควบคุมมลพิษ', 2),
	(78, 'กรมทรัพยากรทางทะเลและชายฝั่ง', 2),
	(79, 'กรมทรัพยากรธรณี', 2),
	(80, 'กรมทรัพยากรน้ำ', 2),
	(81, 'กรมทรัพยากรน้ำบาดาล', 2),
	(82, 'กรมป่าไม้', 2),
	(83, 'กรมส่งเสริมคุณภาพสิ่งแวดล้อม', 2),
	(84, 'กรมอุทยานแห่งชาติ สัตว์ป่า และพันธุ์พืช', 2),
	(85, 'สำนักงานนโยบายและแผนทรัพยากรธรรมชาติและสิ่งแวดล้อม', 2),
	(86, 'สำนักงานปลัดกระทรวงพลังงาน', 2),
	(87, 'กรมเชื้อเพลิงธรรมชาติ', 2),
	(88, 'กรมธุรกิจพลังงาน', 2),
	(89, 'กรมพัฒนาพลังงานทดแทนและอนุรักษ์พลังงาน', 2),
	(90, 'สำนักงานนโยบายและแผนพลังงาน', 2),
	(91, 'สำนักงานปลัดกระทรวงพาณิชย์', 2),
	(92, 'กรมการค้าต่างประเทศ', 2),
	(93, 'กรมการค้าภายใน', 2),
	(94, 'กรมเจรจาการค้าระหว่างประเทศ', 2),
	(95, 'กรมทรัพย์สินทางปัญญา', 2),
	(96, 'กรมพัฒนาธุรกิจการค้า', 2),
	(97, 'กรมส่งเสริมการค้าระหว่างประเทศ', 2),
	(98, 'สำนักงานนโยบายและยุทธศาสตร์การค้า', 2),
	(99, 'สำนักงานปลัดกระทรวงมหาดไทย', 2),
	(100, 'กรมการปกครอง', 2),
	(101, 'กรมการพัฒนาชุมชน', 2),
	(102, 'กรมที่ดิน', 2),
	(103, 'กรมป้องกันและบรรเทาสาธารณภัย', 2),
	(104, 'กรมโยธาธิการและผังเมือง', 2),
	(105, 'กรมส่งเสริมการปกครองท้องถิ่น', 2),
	(106, 'สำนักงานปลัดกระทรวงยุติธรรม', 2),
	(107, 'กรมคุมประพฤติ', 2),
	(108, 'กรมคุ้มครองสิทธิและเสรีภาพ', 2),
	(109, 'กรมบังคับคดี', 2),
	(110, 'กรมพินิจและคุ้มครองเด็กและเยาวชน', 2),
	(111, 'กรมราชทัณฑ์', 2),
	(112, 'กรมสอบสวนคดีพิเศษ', 2),
	(113, 'สถาบันนิติวิทยาศาสตร์', 2),
	(114, 'สำนักงานกิจการยุติธรรม', 2),
	(115, 'สำนักงานคณะกรรมการป้องกันและปราบปรามยาเสพติด', 2),
	(116, 'สำนักงานปลัดกระทรวงแรงงาน', 2),
	(117, 'กรมการจัดหางาน', 2),
	(118, 'กรมพัฒนาฝีมือแรงงาน', 2),
	(119, 'กรมสวัสดิการและคุ้มครองแรงงาน ', 2),
	(120, 'สำนักงานประกันสังคม', 2),
	(121, 'สำนักงานปลัดกระทรวงวัฒนธรรม', 2),
	(122, 'กรมการศาสนา', 2),
	(123, 'กรมศิลปากร', 2),
	(124, 'กรมส่งเสริมวัฒนธรรม', 2),
	(125, 'สถาบันบัณฑิตพัฒนศิลป์', 2),
	(126, 'สำนักงานศิลปวัฒนธรรมร่วมสมัย', 2),
	(127, 'สำนักงานปลัดกระทรวงศึกษาธิการ', 2),
	(128, 'สำนักงานคณะกรรมการการศึกษาขั้นพื้นฐาน', 2),
	(129, 'สำนักงานคณะกรรมการการอาชีวศึกษา', 2),
	(130, 'สำนักงานเลขาธิการสภาการศึกษา', 2),
	(131, 'สำนักงานปลัดกระทรวงสาธารณสุข', 2),
	(132, 'กรมการแพทย์', 2),
	(133, 'กรมการแพทย์แผนไทยและการแพทย์ทางเลือก', 2),
	(134, 'กรมควบคุมโรค', 2),
	(135, 'กรมวิทยาศาสตร์การแพทย์', 2),
	(136, 'กรมสนับสนุนบริการสุขภาพ', 2),
	(137, 'กรมสุขภาพจิต', 2),
	(138, 'กรมอนามัย', 2),
	(139, 'สถาบันพระบรมราชชนก', 2),
	(140, 'สำนักงานคณะกรรมการอาหารและยา', 2),
	(141, 'สำนักงานปลัดกระทรวงอุตสาหกรรม ', 2),
	(142, 'กรมโรงงานอุตสาหกรรม', 2),
	(143, 'กรมส่งเสริมอุตสาหกรรม', 2),
	(144, 'กรมอุตสาหกรรมพื้นฐานและการเหมืองแร่', 2),
	(145, 'สำนักงานคณะกรรมการอ้อยและน้ำตาลทราย', 2),
	(146, 'สำนักงานมาตรฐานผลิตภัณฑ์อุตสาหกรรม', 2),
	(147, 'สำนักงานเศรษฐกิจอุตสาหกรรม', 2),
	(148, 'ศูนย์อำนวยการบริหารจังหวัดชายแดนภาคใต้ (ศอ.บต.)', 2),
	(149, 'สำนักงานคณะกรรมการป้องกันและปราบปรามการทุจริตในภาครัฐ', 2),
	(150, 'สำนักงานคณะกรรมการพิเศษเพื่อประสานงานโครงการอันเนื่องมาจากพระราชดำริ', 2),
	(151, 'สำนักงานตำรวจแห่งชาติ', 2),
	(152, 'สำนักงานป้องกันและปราบปรามการฟอกเงิน', 2),
	(153, 'สำนักงานพระพุทธศาสนาแห่งชาติ', 2),
	(154, 'สำนักงานราชบัณฑิตยสภา', 2),
	(155, 'สำนักงานคณะกรรมการนโยบายเขตพัฒนาพิเศษภาคตะวันออก ', 2),
	(156, 'สำนักงานส่งเสริมวิสาหกิจเพื่อสังคม', 2),
	(157, 'สถาบันพระปกเกล้า', 2),
	(158, 'สำนักงานเลขาธิการวุฒิสภา', 2),
	(159, 'สำนักงานเลขาธิการสภาผู้แทนราษฎร', 2),
	(160, 'สำนักงานศาลปกครอง', 2),
	(161, 'สำนักงานศาลยุติธรรม', 2),
	(162, 'สำนักงานศาลรัฐธรรมนูญ', 2),
	(163, 'สำนักงานการตรวจเงินแผ่นดิน', 2),
	(164, 'สำนักงานคณะกรรมการการเลือกตั้ง', 2),
	(165, 'สำนักงานคณะกรรมการป้องกันและปราบปรามการทุจริตแห่งชาติ', 2),
	(166, 'สำนักงานคณะกรรมการสิทธิมนุษยชนแห่งชาติ', 2),
	(167, 'สำนักงานผู้ตรวจการแผ่นดิน', 2),
	(168, 'สำนักงานอัยการสูงสุด', 2),
	(169, 'สำนักงานคณะกรรมการการแข่งขันทางการค้า', 2),
	(170, 'สำนักงานสภาเกษตรกรแห่งชาติ', 2),
	(171, 'ส่วนราชการในพระองค์', 2),
	(172, 'การกีฬาแห่งประเทศไทย', 1),
	(173, 'การเคหะแห่งชาติ', 1),
	(174, 'การท่องเที่ยวแห่งประเทศไทย', 1),
	(175, 'การทางพิเศษแห่งประเทศไทย', 1),
	(176, 'การประปานครหลวง', 1),
	(177, 'การประปาส่วนภูมิภาค', 1),
	(178, 'การยางแห่งประเทศไทย', 1),
	(179, 'การรถไฟฟ้าขนส่งมวลชนแห่งประเทศไทย ', 1),
	(180, 'การรถไฟแห่งประเทศไทย', 1),
	(181, 'ธนาคารพัฒนาวิสาหกิจขนาดกลางและขนาดย่อมแห่งประเทศไทย', 1),
	(182, 'ธนาคารเพื่อการเกษตรและสหกรณ์การเกษตร', 1),
	(183, 'ธนาคารเพื่อการส่งออกและนำเข้าแห่งประเทศไทย', 1),
	(184, 'ธนาคารออมสิน', 1),
	(185, 'ธนาคารอาคารสงเคราะห์', 1),
	(186, 'บรรษัทประกันสินเชื่ออุตสาหกรรมขนาดย่อม', 1),
	(187, 'สถาบันการบินพลเรือน', 1),
	(188, 'สถาบันวิจัยวิทยาศาสตร์และเทคโนโลยีแห่งประเทศไทย', 1),
	(189, 'องค์การขนส่งมวลชนกรุงเทพ ', 1),
	(190, 'องค์การจัดการน้ำเสีย', 1),
	(191, 'องค์การตลาดเพื่อเกษตรกร', 1),
	(192, 'องค์การพิพิธภัณฑ์วิทยาศาสตร์แห่งชาติ', 1),
	(193, 'องค์การสวนพฤกษศาสตร์', 1),
	(194, 'องค์การสวนสัตว์แห่งประเทศไทย', 1),
	(195, 'องค์การอุตสาหกรรมป่าไม้', 1),
	(196, 'สภากาชาดไทย', 1),
	(197, 'สำนักงานคณะกรรมการสุขภาพแห่งชาติ', 1),
	(198, 'สถาบันคุณวุฒิวิชาชีพ (องค์การมหาชน)', 1),
	(199, 'สถาบันบริหารจัดการธนาคารที่ดิน (องค์การมหาชน)', 1),
	(200, 'สำนักงานคณะกรรมการการรักษาความมั่นคงปลอดภัยไซเบอร์แห่งชาติ', 1),
	(201, 'สำนักงานบริหารและพัฒนาองค์ความรู้ (องค์การมหาชน)', 1),
	(202, 'สำนักงานพัฒนาพิงคนคร (องค์การมหาชน)  ', 1),
	(203, 'สำนักงานพัฒนารัฐบาลดิจิทัล (องค์การมหาชน) ', 1),
	(204, 'สำนักงานส่งเสริมการจัดประชุมและนิทรรศการ (องค์การมหาชน)', 1),
	(205, 'สำนักงานส่งเสริมเศรษฐกิจสร้างสรรค์ (องค์การมหาชน)', 1),
	(206, 'สถาบันเทคโนโลยีป้องกันประเทศ ', 1),
	(207, 'สำนักงานความร่วมมือพัฒนาเศรษฐกิจกับประเทศเพื่อนบ้าน (องค์การมหาชน)', 1),
	(208, 'องค์การบริหารการพัฒนาพื้นที่พิเศษเพื่อการท่องเที่ยวอย่างยั่งยืน (องค์การมหาชน)', 1),
	(209, 'สถาบันพัฒนาองค์กรชุมชน (องค์การมหาชน)', 1),
	(210, 'สถาบันมาตรวิทยาแห่งชาติ', 1),
	(211, 'สำนักงานคณะกรรมการส่งเสริมวิทยาศาสตร์ วิจัยและนวัตกรรม', 1),
	(212, 'สำนักงานพัฒนาวิทยาศาสตร์และเทคโนโลยีแห่งชาติ', 1),
	(213, 'สำนักงานสภานโยบายการอุดมศึกษา วิทยาศาสตร์ วิจัยและนวัตกรรมแห่งชาติ (สอวช.)', 1),
	(214, 'ศูนย์ความเป็นเลิศด้านชีววิทยาศาสตร์ (องค์การมหาชน)', 1),
	(215, 'สถาบันเทคโนโลยีนิวเคลียร์แห่งชาติ (องค์การมหาชน)', 1),
	(216, 'สถาบันวิจัยดาราศาสตร์แห่งชาติ (องค์การมหาชน) ', 1),
	(217, 'สถาบันวิจัยแสงซินโครตรอน (องค์การมหาชน)', 1),
	(218, 'สถาบันสารสนเทศทรัพยากรน้ำ (องค์การมหาชน)', 1),
	(219, 'สำนักงานนวัตกรรมแห่งชาติ (องค์การมหาชน)', 1),
	(220, 'สำนักงานพัฒนาเทคโนโลยีอวกาศและภูมิสารสนเทศ (องค์การมหาชน) ', 1),
	(221, 'สถาบันวิจัยและพัฒนาพื้นที่สูง (องค์การมหาชน)', 1),
	(222, 'สำนักงานพิพิธภัณฑ์เกษตรเฉลิมพระเกียรติพระบาทสมเด็จพระเจ้าอยู่หัว (องค์การมหาชน)', 1),
	(223, 'สำนักงานพัฒนาธุรกรรมทางอิเล็กทรอนิกส์', 1),
	(224, 'สำนักงานส่งเสริมเศรษฐกิจดิจิทัล (องค์การมหาชน)', 1),
	(225, 'สำนักงานพัฒนาเศรษฐกิจจากฐานชีวภาพ (องค์การมหาชน)', 1),
	(226, 'องค์การบริหารจัดการก๊าซเรือนกระจก (องค์การมหาชน)', 1),
	(227, 'สถาบันระหว่างประเทศเพื่อการค้าและการพัฒนา (องค์การมหาชน)', 1),
	(228, 'สถาบันวิจัยและพัฒนาอัญมณีและเครื่องประดับแห่งชาติ (องค์การมหาชน)', 1),
	(229, 'สถาบันส่งเสริมศิลปหัตถกรรมไทย (องค์การมหาชน)', 1),
	(230, 'สถาบันอนุญาโตตุลาการ', 1),
	(231, 'สถาบันเพื่อการยุติธรรมแห่งประเทศไทย (องค์การมหาชน)', 1),
	(232, 'สถาบันส่งเสริมความปลอดภัย อาชีวอนามัย และสภาพแวดล้อมในการทำงาน (องค์การมหาชน)', 1),
	(233, 'ศูนย์คุณธรรม (องค์การมหาชน)', 1),
	(234, 'ศูนย์มานุษยวิทยาสิรินธร (องค์การมหาชน)', 1),
	(235, 'หอภาพยนตร์ (องค์การมหาชน)', 1),
	(236, 'สถาบันส่งเสริมการสอนวิทยาศาสตร์และเทคโนโลยี (สสวท.)', 1),
	(237, 'สำนักงานคณะกรรมการส่งเสริมสวัสดิการและสวัสดิภาพครูและบุคลากรทางการศึกษา', 1),
	(238, 'สำนักงานเลขาธิการคุรุสภา', 1),
	(239, 'โรงเรียนมหิดลวิทยานุสรณ์', 1),
	(240, 'สถาบันทดสอบทางการศึกษาแห่งชาติ (องค์การมหาชน)', 1),
	(241, 'สำนักงานรับรองมาตรฐานและประเมินคุณภาพการศึกษา (องค์การมหาชน)', 1),
	(242, 'สถาบันการแพทย์ฉุกเฉินแห่งชาติ', 1),
	(243, 'สถาบันวิจัยระบบสาธารณสุข', 1),
	(244, 'สำนักงานหลักประกันสุขภาพแห่งชาติ', 1),
	(245, 'สถาบันวัคซีนแห่งชาติ (องค์การมหาชน)', 1),
	(246, 'โรงพยาบาลบ้านแพ้ว (องค์การมหาชน)', 1),
	(247, 'สถาบันรับรองคุณภาพสถานพยาบาล (องค์การมหาชน)', 1),
	(248, 'สถาบันวิจัยและพัฒนาเทคโนโลยีระบบราง (องค์การมหาชน)', 1),
	(249, 'สำนักงานคณะกรรมการคุ้มครองข้อมูลส่วนบุคคล (องค์การมหาชน)', 1);

-- Dumping structure for table app_register.register_form1
CREATE TABLE IF NOT EXISTS `register_form1` (
  `form_id` int NOT NULL AUTO_INCREMENT,
  `title_name_th` varchar(30) CHARACTER SET utf8mb3 COLLATE utf8mb3_general_ci DEFAULT NULL,
  `fname_th` varchar(255) CHARACTER SET utf8mb3 COLLATE utf8mb3_general_ci DEFAULT NULL,
  `lname_th` varchar(255) CHARACTER SET utf8mb3 COLLATE utf8mb3_general_ci DEFAULT NULL,
  `position` varchar(255) CHARACTER SET utf8mb3 COLLATE utf8mb3_general_ci DEFAULT NULL,
  `org_id_root` int DEFAULT NULL,
  `mobile` varchar(15) CHARACTER SET utf8mb3 COLLATE utf8mb3_general_ci DEFAULT NULL,
  `email` varchar(255) CHARACTER SET utf8mb3 COLLATE utf8mb3_general_ci DEFAULT NULL,
  `food` varchar(255) DEFAULT NULL,
  `created_at` timestamp NULL DEFAULT NULL,
  `updated_at` timestamp NULL DEFAULT NULL,
  `status` tinyint(1) DEFAULT '1',
  PRIMARY KEY (`form_id`) USING BTREE
) ENGINE=InnoDB AUTO_INCREMENT=7 DEFAULT CHARSET=utf8mb3 ROW_FORMAT=DYNAMIC;

-- Dumping data for table app_register.register_form1: ~0 rows (approximately)
INSERT INTO `register_form1` (`form_id`, `title_name_th`, `fname_th`, `lname_th`, `position`, `org_id_root`, `mobile`, `email`, `food`, `created_at`, `updated_at`, `status`) VALUES
	(6, 'นาย', 'ณัติรุจน์', 'คายทอง', 'นวก.คอมฯ', 1, '09888294941', 'moonoise@gmail.com', 'ไม่ระบุ', '2023-03-21 04:06:48', NULL, 1);

-- Dumping structure for table app_register.register_form2
CREATE TABLE IF NOT EXISTS `register_form2` (
  `form_id` int NOT NULL AUTO_INCREMENT,
  `title_name_th` varchar(30) DEFAULT NULL,
  `fname_th` varchar(255) DEFAULT NULL,
  `lname_th` varchar(255) DEFAULT NULL,
  `position` varchar(255) DEFAULT NULL,
  `org_id_root` int DEFAULT NULL,
  `mobile` varchar(15) DEFAULT NULL,
  `email` varchar(255) DEFAULT NULL,
  `food` varchar(255) DEFAULT NULL,
  `created_at` timestamp NULL DEFAULT NULL,
  `updated_at` timestamp NULL DEFAULT NULL,
  `status` tinyint(1) DEFAULT '1',
  PRIMARY KEY (`form_id`)
) ENGINE=InnoDB AUTO_INCREMENT=3 DEFAULT CHARSET=utf8mb3;

-- Dumping data for table app_register.register_form2: ~0 rows (approximately)
INSERT INTO `register_form2` (`form_id`, `title_name_th`, `fname_th`, `lname_th`, `position`, `org_id_root`, `mobile`, `email`, `food`, `created_at`, `updated_at`, `status`) VALUES
	(2, 'นาย', 'ณัติรุจน์', 'คายทอง', 'นวก.คอมฯ', 172, '09888294941', 'moonoise@gmail.com', 'อิสลาม', '2023-03-21 04:11:18', NULL, 1);

-- Dumping structure for table app_register.useronline
CREATE TABLE IF NOT EXISTS `useronline` (
  `useronline_id` int NOT NULL AUTO_INCREMENT,
  `username_ip` varchar(100) DEFAULT NULL,
  `timestamp` varchar(15) DEFAULT NULL,
  PRIMARY KEY (`useronline_id`),
  UNIQUE KEY `per_cardno_ip` (`username_ip`)
) ENGINE=InnoDB AUTO_INCREMENT=12 DEFAULT CHARSET=utf8mb3 ROW_FORMAT=COMPACT;

-- Dumping data for table app_register.useronline: ~1 rows (approximately)
INSERT INTO `useronline` (`useronline_id`, `username_ip`, `timestamp`) VALUES
	(1, 'moonoise-::1', '1607942015'),
	(11, 'admin-127.0.0.1', '1679309768');

/*!40103 SET TIME_ZONE=IFNULL(@OLD_TIME_ZONE, 'system') */;
/*!40101 SET SQL_MODE=IFNULL(@OLD_SQL_MODE, '') */;
/*!40014 SET FOREIGN_KEY_CHECKS=IFNULL(@OLD_FOREIGN_KEY_CHECKS, 1) */;
/*!40101 SET CHARACTER_SET_CLIENT=@OLD_CHARACTER_SET_CLIENT */;
/*!40111 SET SQL_NOTES=IFNULL(@OLD_SQL_NOTES, 1) */;
